Revit 2027 API
ParameterTypeId.FbxLightLumenaireDirt Property
 "Luminaire Dirt Depreciation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightLumenaireDirt { get; }
Public Shared ReadOnly Property FbxLightLumenaireDirt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightLumenaireDirt {
	ForgeTypeId^ get ();
}
static member FbxLightLumenaireDirt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace